Revit 2027 API
EnergyDataSettings.IsDocumentUsingEnergyDataAnalyticalModel Method
Note: This API is now obsolete.
 Get EnergyDataSettings element and if it exists, return result from getCreateAnalyticalModel.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public static bool IsDocumentUsingEnergyDataAnalyticalModel(
	Document ccda
)
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Shared Function IsDocumentUsingEnergyDataAnalyticalModel (
	ccda As Document
) As Boolean
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
static bool IsDocumentUsingEnergyDataAnalyticalModel(
	Document^ ccda
)
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
static member IsDocumentUsingEnergyDataAnalyticalModel :
        ccda : Document -> bool
Parameters
ccda Document
 The document.
Return Value
Boolean
 Returns true if the Conceptual Energy Analytical Model is enabled, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace